[
  {"id": 1, "name": "Vernetzung", "definition": "Die Vernetzung von Maschinen, Anlagen und Produkten ermöglicht den Datenaustausch und die Zusammenarbeit in Echtzeit."},
  {"id": 2, "name": "Digitalisierung", "definition": "Die Digitalisierung von Prozessen und Produkten ermöglicht die Erfassung und Verarbeitung großer Datenmengen."},
  {"id": 3, "name": "Automatisierung", "definition": "Die Automatisierung von Produktionsprozessen führt zu einer effizienten und präzisen Fertigung."},
  {"id": 4, "name": "Cyber-Physische Systeme", "definition": "Die Verbindung von virtueller und physischer Welt ermöglicht die Steuerung und Überwachung von Produktionsprozessen in Echtzeit."},
  {"id": 5, "name": "Internet of Things (IoT)", "definition": "Die Vernetzung von physischen Objekten ermöglicht die Fernsteuerung und Überwachung von Geräten und Maschinen."},
  {"id": 6, "name": "Cloud Computing", "definition": "Die Nutzung von Cloud-Diensten ermöglicht den Zugriff auf Ressourcen und Daten von überall aus."},
  {"id": 7, "name": "Big Data", "definition": "Die Auswertung großer Datenmengen ermöglicht fundierte Entscheidungen und Prognosen."},
  {"id": 8, "name": "Künstliche Intelligenz", "definition": "Die Nutzung von KI-Technologien ermöglicht die Automatisierung komplexer Aufgaben und die Optimierung von Prozessen."},
  {"id": 9, "name": "Mensch-Maschine-Interaktion", "definition": "Die Interaktion zwischen Mensch und Maschine wird durch intuitive Benutzeroberflächen und Sprachsteuerung verbessert."},
  {"id": 10, "name": "Augmented Reality (AR)", "definition": "Die Einblendung von digitalen Informationen in die physische Umgebung ermöglicht eine verbesserte Wartung und Fehlerbehebung."},
  {"id": 11, "name": "Additive Fertigung", "definition": "Die additive Fertigung, auch 3D-Druck genannt, ermöglicht die Herstellung komplexer Bauteile."},
  {"id": 12, "name": "Predictive Maintenance", "definition": "Die vorausschauende Wartung ermöglicht die rechtzeitige Erkennung von Wartungsbedarf und die Vermeidung von Ausfällen."},
  {"id": 13, "name": "Digitaler Zwilling", "definition": "Die digitale Abbildung von physischen Produkten und Anlagen ermöglicht Simulationen und Optimierungen."},
  {"id": 14, "name": "Echtzeit-Analyse", "definition": "Die Echtzeit-Analyse von Produktionsdaten ermöglicht schnelle Reaktionen auf Veränderungen."},
  {"id": 15, "name": "Autonome Systeme", "definition": "Autonome Roboter und Fahrzeuge ermöglichen den automatisierten Transport und die Montage von Produkten."},
  {"id": 16, "name": "Intelligente Logistik", "definition": "Die Optimierung der Logistikprozesse ermöglicht eine effiziente Lieferkette."},
  {"id": 17, "name": "Flexibilität", "definition": "Die flexible Anpassung von Produktionsprozessen ermöglicht eine schnelle Reaktion auf Kundenwünsche."},
  {"id": 18, "name": "Sicherheit", "definition": "Die Sicherheit von Daten und Systemen ist ein wichtiger Aspekt, um Industrie 4.0 erfolgreich umzusetzen."},
  {"id": 19, "name": "Nachhaltigkeit", "definition": "Die Nutzung von ressourcenschonenden Prozessen und Materialien fördert die Nachhaltigkeit in der Produktion."},
  {"id": 20, "name": "Interoperabilität", "definition": "Die Interoperabilität von Systemen ermöglicht die nahtlose Zusammenarbeit verschiedener Komponenten."},
  {"id": 21, "name": "Predictive Analytics", "definition": "Die Nutzung von Vorhersagemodellen ermöglicht die Antizipation von Ereignissen und Trends."},
  {"id": 22, "name": "Machine Learning", "definition": "Das maschinelle Lernen ermöglicht es Maschinen, aus Erfahrungen zu lernen und sich selbst zu verbessern."},
  {"id": 23, "name": "Digitale Fabriken", "definition": "Die Einrichtung digitaler Fabriken ermöglicht eine flexible und vernetzte Produktion."},
  {"id": 24, "name": "Digitale Supply Chain", "definition": "Die Digitalisierung der Lieferkette ermöglicht eine transparente und effiziente Materialversorgung."},
  {"id": 25, "name": "Plattformökonomie", "definition": "Die Nutzung von Plattformen ermöglicht die Integration verschiedener Produkte und Dienstleistungen."},
  {"id": 26, "name": "Predictive Quality", "definition": "Die Vorhersage von Produktqualität ermöglicht die frühzeitige Erkennung von Qualitätsproblemen."},
  {"id": 27, "name": "Virtuelle Inbetriebnahme", "definition": "Die virtuelle Inbetriebnahme ermöglicht die Simulation von Produktionsprozessen vor der realen Umsetzung."},
  {"id": 28, "name": "Blockchain", "definition": "Die Nutzung von Blockchain-Technologie ermöglicht eine sichere und transparente Datenverwaltung."},
  {"id": 29, "name": "Selbstoptimierung", "definition": "Die Selbstoptimierung von Produktionsprozessen führt zu einer kontinuierlichen Verbesserung."},
  {"id": 30, "name": "Autonome Entscheidungen", "definition": "Die Nutzung von Algorithmen ermöglicht autonome Entscheidungen von Maschinen und Systemen."},
  {"id": 31, "name": "Digitale Assistenten", "definition": "Die Unterstützung durch digitale Assistenten verbessert die Produktionsabläufe."},
  {"id": 32, "name": "IT-Sicherheit", "definition": "Die Sicherheit von IT-Systemen ist ein wichtiger Aspekt in der Industrie 4.0."},
  {"id": 33, "name": "Robotik", "definition": "Der Einsatz von Robotern ermöglicht eine effiziente und präzise Fertigung."},
  {"id": 34, "name": "Smart Maintenance", "definition": "Die intelligente Wartung ermöglicht eine vorausschauende Instandhaltung."},
  {"id": 35, "name": "Mobile Technologien", "definition": "Der Einsatz von mobilen Geräten ermöglicht eine flexible Steuerung und Überwachung."},
  {"id": 36, "name": "Data Analytics", "definition": "Die Auswertung von Daten ermöglicht fundierte Geschäftsentscheidungen."},
  {"id": 37, "name": "Predictive Analytics", "definition": "Die Vorhersage von Ereignissen ermöglicht eine proaktive Planung."},
  {"id": 38, "name": "Digitale Transformation", "definition": "Die digitale Transformation ermöglicht die Modernisierung von Geschäftsprozessen."},
  {"id": 39, "name": "Virtuelle Realität", "definition": "Die Nutzung von VR-Technologien ermöglicht virtuelle Simulationen."},
  {"id": 40, "name": "Augmented Reality", "definition": "Die Einblendung von digitalen Informationen in die reale Umgebung verbessert die Arbeitseffizienz."}
]
