[
  {"id": 1, "name": "Wasserfallmodell", "definition": "Das Wasserfallmodell ist ein sequenzielles Vorgehensmodell, bei dem die Entwicklung in linearen Phasen abläuft. Jede Phase muss abgeschlossen sein, bevor die nächste beginnt. Es eignet sich gut für gut definierte Projekte, bei denen Anforderungen stabil sind."},
  {"id": 2, "name": "Agile Entwicklung", "definition": "Die Agile Entwicklung ist ein iteratives und inkrementelles Vorgehensmodell, das die Zusammenarbeit und Flexibilität betont. Es beinhaltet kurze Entwicklungszyklen, sogenannte Sprints, und regelmäßige Anpassungen basierend auf Kundenfeedback."},
  {"id": 3, "name": "Scrum", "definition": "Scrum ist ein spezielles agiles Vorgehensmodell, das die Entwicklung in fixe Zeitabschnitte (Sprints) organisiert. Es beinhaltet festgelegte Rollen wie Scrum Master und Product Owner und fördert die Kommunikation im Entwicklungsteam."},
  {"id": 4, "name": "Kanban", "definition": "Kanban ist ein agiles Vorgehensmodell, das den Fokus auf die Visualisierung und Steuerung von Arbeitsabläufen legt. Es verwendet ein Kanban-Board, um den Fortschritt der Aufgaben zu verfolgen und Engpässe zu identifizieren."},
  {"id": 5, "name": "V-Modell", "definition": "Das V-Modell ist ein erweitertes Wasserfallmodell, das den Testprozess stark betont. Es hat eine klare Verknüpfung zwischen den Entwicklungsphasen und den entsprechenden Testphasen."},
  {"id": 6, "name": "Spiralmodell", "definition": "Das Spiralmodell ist ein iteratives Vorgehensmodell, das Risikomanagement betont. Jede Iteration durchläuft Planung, Risikoanalyse, Engineering und Bewertung, um Risiken frühzeitig zu erkennen und zu reduzieren."},
  {"id": 7, "name": "Prototypmodell", "definition": "Das Prototypmodell betont die Erstellung von Prototypen, um Anforderungen zu klären und Kundenfeedback zu erhalten. Es ist besonders nützlich in Situationen mit unsicheren Anforderungen."},
  {"id": 8, "name": "Inkrementelles Vorgehensmodell", "definition": "Das inkrementelle Vorgehensmodell teilt die Entwicklung in kleine Teilschritte auf. Mit jedem Schritt wird ein neues Inkrement hinzugefügt, bis das endgültige Produkt erreicht ist."},
  {"id": 9, "name": "Rational Unified Process (RUP)", "definition": "RUP ist ein iteratives Vorgehensmodell, das auf bewährten Praktiken basiert. Es betont die Anpassung an die Projektanforderungen und enthält eine Vielzahl von Vorlagen und Richtlinien."},
  {"id": 10, "name": "Extreme Programming (XP)", "definition": "Extreme Programming ist ein agiles Vorgehensmodell, das auf Engineering-Praktiken wie kontinuierliche Integration, Testgetriebene Entwicklung und Paarprogrammierung setzt."}
]
